work/WinVent/Kastenfenster/V04/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

9
(
    atmosphere_ground
    {
        type            wall;
        inGroups        List<word> 
2
(
atmosphere
wall
)
;
        nFaces          280;
        startFace       136231;
    }
    atmosphere_outlet
    {
        type            patch;
        inGroups        List<word> 1(atmosphere);
        nFaces          1526;
        startFace       136511;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 
2
(
staticWalls
wall
)
;
        nFaces          992;
        startFace       138037;
    }
    window
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1577;
        startFace       139029;
    }
    outflow
    {
        type            patch;
        inGroups        List<word> 1(outflow);
        nFaces          32;
        startFace       140606;
    }
    glass_inside_master
    {
        type            mappedWall;
        inGroups        List<word> 
3
(
wall
mapped
glass_inside
)
;
        nFaces          0;
        startFace       140638;
        neighbourRegion region0;
        neighbourPatch  glass_inside_slave;
        transformType   none;
        method          nearest;
    }
    glass_inside_slave
    {
        type            mappedWall;
        inGroups        List<word> 
3
(
wall
mapped
glass_inside
)
;
        nFaces          0;
        startFace       140638;
        neighbourRegion region0;
        neighbourPatch  glass_inside_master;
        transformType   none;
        method          nearest;
    }
    glass_outside_master
    {
        type            mappedWall;
        inGroups        List<word> 
3
(
wall
mapped
glass_outside
)
;
        nFaces          3584;
        startFace       140638;
        neighbourRegion region0;
        neighbourPatch  glass_outside_slave;
        transformType   none;
        method          nearest;
    }
    glass_outside_slave
    {
        type            mappedWall;
        inGroups        List<word> 
3
(
wall
mapped
glass_outside
)
;
        nFaces          3584;
        startFace       144222;
        neighbourRegion region0;
        neighbourPatch  glass_outside_master;
        transformType   none;
        method          nearest;
    }
)

// ************************************************************************* //
